import java.util.stream.IntStream;

public class 나머지가1이되는수찾기 {
    /********************************************************************************************************
     * 내 풀이
     ********************************************************************************************************/
    public int solution(int n) {
        for(int i = 2; i < n/2; i++){
            if(n % i == 1){
                return i;
            }
        }
        return n - 1;
    }
    /********************************************************************************************************
     * Stream 활용풀이
     ********************************************************************************************************/
    public int solution2(int n) {
        return IntStream.range(2, n).filter(i -> n % i == 1).findFirst().orElse(0);
    }
    /********************************************************************************************************
     * main
     ********************************************************************************************************/
    public static void main(String[] args) {
        나머지가1이되는수찾기 sol = new 나머지가1이되는수찾기();
        int n = 11;
        int solution = sol.solution(n);
        System.out.println("solution = " + solution);
        System.out.println("n/2 = " + n/2);
        System.out.println("n%2 = " + n%2);
    }
}
