#include<bits/stdc++.h>
using namespace std;

//////////////////////////////////////////////////////////////////////
/**
 * 조합 (combinations)
 * - 조합에는 "순서"는 없음
 * - 순서 상관없이 오로지 몇개를 뽑을때 조합을 사용
 * - 5개중에 3개를 뽑는다면?
 * - ex: 자연수(1, 2, 3, 4, 5)
 * - -> 123, 124, 125, 134, 135, 145, 234, 235, 245, 345 이렇게 10개!
 * 
 * 조합 공식 : nCr = n! / (n-r)! r!
 * - 만약 5개중 3개를 뽑는다면? 5! / (5-3)! 3!
 * - 만약 3개중 2개를 뽑는다면? 3! / (3-2)! 2!
 */
//////////////////////////////////////////////////////////////////////

void print(vector<int> b) {
    for(int i : b) {
        cout << i << " ";
    }
    cout << "\n";
};

// 재귀를 이용한 조합 함수
void combi(int start, vector<int> b, int n, int k) {
    if(b.size() == k) {
        // logic
        print(b);
        return;
    }
    for(int i = start + 1; i < n; i++){
        b.push_back(i);
        combi(i, b, n, k); // i는 인덱스 0부터
        b.pop_back();
    }
    return;
};

int main() {
    // //////////////////////////////////////////////////////////////////////
    // /**
    //  * 재귀를 이용한 조합
    //  * - 4개 이상을 뽑을때는 재귀를 이용하는게 좋음
    //  * - 도식화 해보자!
    //  */
    // //////////////////////////////////////////////////////////////////////
    // int n = 5;
    // int k = 3;
    // int a[5] = {1, 2, 3, 4, 5};
    // vector<int> b;
    // combi(-1, b, n, k);

    //////////////////////////////////////////////////////////////////////
    /**
     * 중첩 for문을 이용한 조합
     * - 3개이하는 중첩 for문 활용
     */
    //////////////////////////////////////////////////////////////////////
    int n = 5;
    int k = 3;
    int a[5] = {1, 2, 3, 4, 5};
    
    // 중첩 for문 1번째 방법
    cout << "중첩 for문 - 1번째 방법 \n";
    for(int i = 0; i < n; i++){
        for(int j = i + 1; j < n; j++){
            for(int k = j + 1; k < n; k++){
            cout << i << " " << j << " " << k << '\n';
            }
        }
    }
    cout << "\n";
    cout << "중첩 for문 - 2번째 방법 \n";
    // 중첩 for문 2번째 방법
    for(int i = 0; i < n; i++){
        for(int j = 0; j < i; j++){
            for(int k = 0; k < j; k++){
                cout << i << " " << j << " " << k << '\n';
            }
        }
    }
    cout << "\n";
    cout << "중첩 for문 - 만약 2개의 조합만 뽑는다면? \n";
    // 만약 r이 2, 즉 2개를 뽑는 것이라면?
    n = 5;
    k = 2;
    for(int i = 0; i < n; i++){
        for(int j = i + 1; j < n; j++){
            cout << i << " " << j << "\n";
        }
    }
    return 0;
}