#include<bits/stdc++.h>
using namespace std;

//////////////////////////////////////////////////////////////////////
/**
 * 재귀함수 (recursion)
 * 재귀함수는 3가지 특징을 가진 함수
 * - 재귀함수 (recursion)는 정의 단계에서 자신을 재참조하는 함수
 * - 전달되는 상태인 매개변수가 달라질 뿐 똑같은 일을 하는 함수
 * - 큰 문제를 작은 부분문제로 나눠서 풀 때 사용
 */
//////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////
/**
 * Factorial (팩토리얼)
 * - 팩토리얼은 1부터 해당 항까지 곱하는 함수
 * - Factorial of a Number
 * - n! = n * (n-1) * (n-2) * ... * 1
 */
//////////////////////////////////////////////////////////////////////

// 재귀함수로 구현한 팩토리얼
int fact_rec(int n) {
    if(n == 1 || n == 0) {
        return 1;
    }
    return n * fact_rec(n - 1);
}

// 반복문으로 구현한 팩토리얼
int fact_for(int n) {
    int ret = 1;
    for(int i = 1; i <= n; i++){
        ret *= i;
    }
    return ret;
}

int main() {
    int n = 5;
    cout << fact_rec(n) << "\n";
    cout << fact_for(n) << "\n";
    return 0;
}